Revit 2024 API
ParameterTypeId.RebarBarHookLengths Property
 "Hook Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarBarHookLengths { get; }
Visual Basic
Public Shared ReadOnly Property RebarBarHookLengths As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarBarHookLengths {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace